In [3]:
import pandas as pd
import numpy as np

In [4]:
string_data=pd.Series(['aardvark','artichoke',np.nan,'avocado'])

In [5]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [6]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
string_data[0]=None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [8]:
from numpy import nan as NA

In [9]:
data=pd.Series([1,NA,3.5,NA,7])

In [10]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data2=pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],
                   [NA,NA,NA],[NA,6.5,3.]])

In [13]:
cleaned=data2.dropna()

In [20]:
data2

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [22]:
data2.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [23]:
data2[4]=NA

In [24]:
data2

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [25]:
data2.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [26]:
import numpy as np

In [27]:
df=pd.DataFrame(np.random.randn(7,3))

In [29]:
df.iloc[:4,1]=NA

In [30]:
df.iloc[:2,2]=NA

In [31]:
df

          0         1         2
0  0.792793       NaN       NaN
1  0.428933       NaN       NaN
2 -0.978452       NaN -2.100868
3  0.586226       NaN  1.120454
4  0.054026 -0.849083 -0.149902
5 -0.579740 -0.991992 -0.200648
6 -0.863777  0.490662 -0.178433

In [32]:
df.dropna()

          0         1         2
4  0.054026 -0.849083 -0.149902
5 -0.579740 -0.991992 -0.200648
6 -0.863777  0.490662 -0.178433

In [33]:
df.dropna(thresh=2)

          0         1         2
2 -0.978452       NaN -2.100868
3  0.586226       NaN  1.120454
4  0.054026 -0.849083 -0.149902
5 -0.579740 -0.991992 -0.200648
6 -0.863777  0.490662 -0.178433

In [34]:
df.fillna(0)

          0         1         2
0  0.792793  0.000000  0.000000
1  0.428933  0.000000  0.000000
2 -0.978452  0.000000 -2.100868
3  0.586226  0.000000  1.120454
4  0.054026 -0.849083 -0.149902
5 -0.579740 -0.991992 -0.200648
6 -0.863777  0.490662 -0.178433

In [35]:
df.fillna({1:0.5, 2:0})

          0         1         2
0  0.792793  0.500000  0.000000
1  0.428933  0.500000  0.000000
2 -0.978452  0.500000 -2.100868
3  0.586226  0.500000  1.120454
4  0.054026 -0.849083 -0.149902
5 -0.579740 -0.991992 -0.200648
6 -0.863777  0.490662 -0.178433

In [36]:
df2=df.copy()

In [37]:
df2

          0         1         2
0  0.792793       NaN       NaN
1  0.428933       NaN       NaN
2 -0.978452       NaN -2.100868
3  0.586226       NaN  1.120454
4  0.054026 -0.849083 -0.149902
5 -0.579740 -0.991992 -0.200648
6 -0.863777  0.490662 -0.178433

In [38]:
_ =df2.fillna(0,inplace=True)

In [41]:
df2

          0         1         2
0  0.792793  0.000000  0.000000
1  0.428933  0.000000  0.000000
2 -0.978452  0.000000 -2.100868
3  0.586226  0.000000  1.120454
4  0.054026 -0.849083 -0.149902
5 -0.579740 -0.991992 -0.200648
6 -0.863777  0.490662 -0.178433

In [40]:
df=pd.DataFrame(np.random.randn(6,3))

In [42]:
df.iloc[2:,1]=NA
df.iloc[4:,2]=NA

In [43]:
df

          0         1         2
0 -0.578315 -0.569412  0.062991
1 -1.537604  0.211525 -1.774053
2  1.080466       NaN -1.555898
3  0.968960       NaN  1.237900
4  0.518570       NaN       NaN
5 -0.359536       NaN       NaN

In [44]:
df.fillna(method='ffill')

          0         1         2
0 -0.578315 -0.569412  0.062991
1 -1.537604  0.211525 -1.774053
2  1.080466  0.211525 -1.555898
3  0.968960  0.211525  1.237900
4  0.518570  0.211525  1.237900
5 -0.359536  0.211525  1.237900

In [45]:
df.fillna(method='ffill',limit=2)

          0         1         2
0 -0.578315 -0.569412  0.062991
1 -1.537604  0.211525 -1.774053
2  1.080466  0.211525 -1.555898
3  0.968960  0.211525  1.237900
4  0.518570       NaN  1.237900
5 -0.359536       NaN  1.237900

In [47]:
data3=pd.Series([1., NA, 3.5, NA, 7])

In [49]:
data3.fillna(data3.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64